In [1]:
import pandas as pd

people = {
    "name":["Abhishek", "Jane", "John"],
    "age" : [32, 45, 56],
    "email":["abhi.gmail.com", "a1.gmail.com", "b1.gmail.com"]
}

In [2]:
df = pd.DataFrame(people)

In [3]:
df

       name  age           email
0  Abhishek   32  abhi.gmail.com
1      Jane   45    a1.gmail.com
2      John   56    b1.gmail.com

In [4]:
df[['email', 'name']]
df.iloc[[1,2], 2]

df.loc[[1,2], ['email', 'age']]

          email  age
1  a1.gmail.com   45
2  b1.gmail.com   56

In [5]:
df.set_index('email', inplace=True)

In [6]:
df.index

Index(['abhi.gmail.com', 'a1.gmail.com', 'b1.gmail.com'], dtype='object', name='email')

In [7]:
df

                    name  age
email
abhi.gmail.com  Abhishek   32
a1.gmail.com        Jane   45
b1.gmail.com        John   56

In [8]:
df.loc['a1.gmail.com']

name    Jane
age       45
Name: a1.gmail.com, dtype: object

In [9]:
df.loc['a1.gmail.com', 'age']

45

In [10]:
df.reset_index(inplace=True)

In [11]:
df

            email      name  age
0  abhi.gmail.com  Abhishek   32
1    a1.gmail.com      Jane   45
2    b1.gmail.com      John   56

In [13]:
filt = (df['name'] == 'Abhishek')  #filter criteria

In [14]:
filt

0     True
1    False
2    False
Name: name, dtype: bool

In [18]:
df[filt]  #extract data from data frame

            email      name  age
0  abhi.gmail.com  Abhishek   32

In [20]:
df.loc[filt]

            email      name  age
0  abhi.gmail.com  Abhishek   32

In [21]:
df.loc[filt, 'age']

0    32
Name: age, dtype: int64

In [22]:
filt = (df['name'] == 'Abhishek') & (df['age'] == 23)

0    False
1    False
2    False
dtype: bool